Revit 2023 API
ColorOptions.BackgroundColor Property
 The background color applied to views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2020.1
Syntax
C#
public Color BackgroundColor { get; set; }
Visual Basic
Public Property BackgroundColor As Color
	Get
	Set
Visual C++
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ColorOptions Class
Autodesk.Revit.DB Namespace